import json
import math
import sys
import threading
from queue import Queue
import requests
import time
from instagrapi import Client
import logging

from db import m_instagram
from dm.prepare import get_dm_source, get_influencer

MAX_USERID_PER_THREAD = 50

FORMAT = '%(module)s.%(funcName)s - %(message)s - %(levelname)s - %(asctime)s'
logging.basicConfig(format=FORMAT)
logger = logging.getLogger(__name__)
if logger.hasHandlers():
    # Logger is already configured, remove all handlers
    logger.handlers = []
logger.setLevel(logging.INFO)

db_conn = m_instagram.InstaDB().conn
INSTA_ACCOUNT_OBJ = m_instagram.InstaAccount(channel_name="instagram")
INSTA_ACCOUNT_OBJ.client_name = "admin_test"

VALID_USERID_LIST = []
def select_user(username=None, max_messages_per_day=None):
    account_setting_info = INSTA_ACCOUNT_OBJ.select_and_update_user(username=username)
    if not account_setting_info:
        logger.info("no account available")
        return None
    else:
        logger.info(f"account is selected:{account_setting_info['username']}/{account_setting_info['password']}")
        return account_setting_info

def login_by_session(session_id, username=None, password=None):
    pass
    # access_key = "nTYC9RbjpV8axJ3I9OnKI9Z4QVu7hzrE"
    # headers = {"x-access-key": access_key}
    # data = {"sessionid": session_id}
    # url = "https://api.lamadava.com/s1/auth/login/by/sessionid"
    # response = requests.post(url=url, data=data, headers=headers)
    # data = json.loads(response.text)
    # try_num = 0
    # while True:
    #     if try_num >=5:
    #         return None
    #     if type(data) is not str:
    #         print(data)
    #         logger.error(f"session return error - username:{username}/password:{password}, session_id:{session_id}")
    #         try_num += 1
    #         continue
    #     logger.info(f"session return success - username:{username}/password:{password}, session_id:{session_id}")
    #     return response


def login(username, password):
    try_num = 0
    while True:
        if try_num >= 3:
            logger.error(f"lamada - login max_try_num:{try_num}")
            return None
        access_key = "nTYC9RbjpV8axJ3I9OnKI9Z4QVu7hzrE"
        headers = {"x-access-key": access_key}
        data = {"username": username, "password": password}
        url = "https://api.lamadava.com/s1/auth/login"
        response = requests.post(url=url, data=data, headers=headers)

        try:
            data = json.loads(response.text)
        except Exception as e:
            logger.error(f"data - {data}/error-{e}/try_num:{try_num}")
            continue

        if type(data) is not str:
            try_num += 1
            logger.error(f"data - {data}/try_num:{try_num}")
            continue

        logger.fatal(f"login:{username}/{password}/ sessionid - {data}")
        return data


def infinite_login(max_messages_per_day, session_id=None):
    while True:
        ##1. 사용할 계정 DB 에서 가져오기
        account_setting_info = select_user(max_messages_per_day=max_messages_per_day)
        if account_setting_info is None:
            logger.fatal("infinite_login_end")
            return None

        ##2. 가져온 계정으로 로그인 시도. session 받아오기
        if session_id:
            login_session = login_by_session(session_id)
        else:
            login_session = login(account_setting_info["username"], account_setting_info["password"])

        ##2.1 가져온 계정으로 로그인이 성공한 경우 받아온 session을 return 해준다

        if login_session:
            account_setting_info.update(graph_session=login_session)
            return account_setting_info

        ##2.2 가져온 계정으로 로그인이 실패한 경우 계정을 새로 가져온다.
        else:
            continue


def send_messages(session_id, user_ids, text, max_messages_per_day):
    access_key = "nTYC9RbjpV8axJ3I9OnKI9Z4QVu7hzrE"
    headers = {"x-access-key": access_key}
    user_ids = list(map(lambda x: str(x), user_ids))
    user_ids = list(set(user_ids))

    logger.info(f"user_ids : {len(user_ids)}")

    for idx, user_id in enumerate(user_ids):
        data = {"sessionid": session_id, "user_ids": [user_id], "text": f"{text}", }
        url = "https://api.lamadava.com/s1/direct/send"
        response = requests.post(url=url, data=data, headers=headers)
        logger.info(idx, user_id, response.text)
        time.sleep(10)

        if idx == max_messages_per_day:
            broken_items = user_ids[user_ids.index(user_id):]
            return broken_items


def send_message(account_info, user_info):
    access_key = "nTYC9RbjpV8axJ3I9OnKI9Z4QVu7hzrE"
    headers = {"x-access-key": access_key}
    sessionid = account_info.get('graph_session')
    username = account_info.get('username')
    password = account_info.get('password')

    text = get_dm_source.get_source_message(filename="golf.txt")
    userid = user_info.get("userid")
    data = {"sessionid": sessionid, "user_ids": [userid], "text": f"{text}"}
    url = "https://api.lamadava.com/s1/direct/send"
    response = requests.post(url=url, data=data, headers=headers)

    if "challenge_required" in response.text:
        logger.error(response.text)
        return 400

    time.sleep(10)
    logger.info(
        f"username:{username} /password:{password}/ sessionid:{sessionid} -> userid:{userid} /response:{response.text}")
    return 200

def get_user_by_id(user_id):
    access_key = "nTYC9RbjpV8axJ3I9OnKI9Z4QVu7hzrE"
    headers = {"x-access-key": access_key}
    params = {"user_id": user_id}
    response = requests.get(url="https://api.lamadava.com/v1/user/by/id", params=params, headers=headers)
    print(response)

def get_user_by_id_thread(q):
    while not q.empty():
        user_ids = q.get()

        if user_ids is None:
            logger.error(f"thread-failed - user_ids is None")
            sys.exit()

        account_info = infinite_login(max_messages_per_day=MAX_USERID_PER_THREAD, session_id=None)
        if account_info.get("graph_session") is None:
            logger.error(f"thread-failed - {user_ids}")

        # 유저리스트에 대해 디엠 발송 시작
        for idx, user_info in enumerate(user_ids):
            ##max_messages_per_day 를 초과하면 다른 아이디로 로그인 시켜준다.
            if idx != 0 and idx % MAX_USERID_PER_THREAD == 0:
                logger.info(f"idx-{idx} 한도 초과. 다른 아이디로 로그인 ")
                account_info = infinite_login(max_messages_per_day=MAX_USERID_PER_THREAD)

            ##메세지 발송
            res = send_message(account_info=account_info, user_info=user_info)

            ##발송 결과가 200 이 아닐때 다른 아이디로 로그인 시켜준다.
            if res != 200:
                logger.info(f"idx-{idx} 에러 발생함. 새로운 아이디로 로그인")
                account_info = infinite_login(max_messages_per_day=MAX_USERID_PER_THREAD)
                continue
        q.task_done()

def run_thread(total_required_thread):
    for idx in range(0, total_required_thread):
        worker = threading.Thread(target=get_userid_thread, args=(jobs,), daemon=True)
        worker.start()

if __name__ == "__main__":
    jobs = Queue()
    user_ids = [11827042812, 50448972414, 49278934360, 50497486123, 1419146483, 1411741273, 49703502023, 1705625402,
                47826214395, 50365745492, 1423788680, 8406223722, 550472416, 14711813031, 50664247042, 1506161726,
                3590298359, 50436678323, 1131657748, 1375765484, 623080694, 3537439067, 3250917156, 1439104436,
                422251898, 50894800110, 6009460084, 3046267244, 44648566759, 44515195816, 1629825726, 642385640,
                1313539741, 1633703690, 1811983722, 5412215552, 6881576194, 1480887557, 6576864954, 496892549,
                31920283635, 49732552971, 48641287229, 50657903898, 5903888547, 1142202644, 7960284139, 336122306,
                8628246142, 3254599693, 6986393647, 1508145786, 3192852832, 1035865451, 1408168928, 1771842180,
                1411407676, 1516907817, 32758184206, 1174291636, 49797636629, 4846605029, 1969637284, 1247379004,
                49809953173, 4077161856, 22159452593, 50161070042, 3670042715, 2121682095, 49834561019, 3287375722,
                1910674828, 12889471451, 49820414984, 50066244165, 1668368323, 2253930968, 1587251310, 212993949,
                1738914310, 5747465541, 17113386535, 37049597126, 1773062, 1831399593, 9393230269, 573881405, 794280645,
                48759407, 1314082452, 2112696884, 32058561609, 1537144803, 7408704236, 370628432, 4978751799,
                5536251588, 3168492082, 44696159511, 3497963079, 716293868, 4177119, 1251688906, 19136945616,
                1693925254, 973752376, 2114595071, 2088375107, 4644344302, 1546644729, 47914595991, 48908922671,
                4492229351, 50296390724, 1682994018, 1471421371, 1749013364, 1192036126, 2103203649, 47667367938,
                3517713751, 38768646606, 1527075631, 1653243346, 3946408263, 540467210, 49571127342, 4662846738,
                1921304221, 8690177241, 1347601408, 1204893991, 50022414534, 2703831987, 324861221, 1352232889,
                507093802, 1362340976, 18327064872, 32221205532, 48551016421, 16150499370, 3032549377, 2317957689,
                49130123475, 33553704508, 529556851, 3605734798, 1048907419, 37613844085, 9415154359, 49770890862,
                4920642667, 4619920772, 32954322248, 2162708135, 3623369045, 5777475344, 1478048254, 4793913,
                4773657105, 2083743079, 1902037155, 2031541852, 3953519018, 48525839901, 7287111435, 19260355341,
                1816436621, 2094028635, 1381637097, 1709824975, 1474814733, 2464434909, 8142199980, 50354225016,
                45445285273, 49570053594, 48488527439, 50074072417, 50246872924, 49619758523, 17077060491, 48389150338,
                50323780796, 47682847915, 50219323326, 47412792861, 49988148448, 7775908498, 49992370269, 50292825862,
                49549532648, 46690779013, 49987921485, 48774273249, 50541784837, 50444586794, 49006572464, 48170839226,
                50060536791, 48524871490, 49366798730, 50035437000, 45289304742, 49966908969, 47909508045, 44492606322,
                14026621330, 6421192904, 49611950433, 49601902518, 49798497389, 50242641716, 49832959835, 47625035628,
                49533987109, 49963300069, 49381259565, 50194750177, 49754210529, 49597095938, 50293595711, 49849622639,
                49843054617, 49890465730, 49572539224, 49858645214, 49793878628, 49120362652, 48839638421, 49596374986,
                50168657022, 49803410601, 49830360600, 49807433893, 49369379492, 49655816612, 48805071970, 7631500018,
                50196526646, 50666180244, 49775558601, 47812213320, 49658098432, 48930827145, 6646431170, 31377695778,
                50176260144, 2013621583, 2270634253, 45298723630, 39551976997, 50199230397, 48638665221, 50018171617,
                50546824149, 50009550921, 48543257078, 32226570671, 1183465802, 3918060414, 46980709930, 1349778025,
                626263329, 50269386484, 1572992902, 1702244068, 50503246185, 335137907, 16653313024, 14545908598,
                17614696429, 10480170204, 29599208513, 50034623781, 49707416319, 18374835421, 14995614940, 44884472633,
                6132608085, 770732708, 45247604181, 21976527391, 21888615595, 1560995783, 12168781679, 35588597132,
                44903336926, 47975632298, 50664163745, 6752701319, 7611974813, 48538731292, 51528858, 2277203559,
                8757180809, 34006009700, 12342823380, 6012843548, 8741015295, 1443482075, 6764375587, 8480811125,
                12906647223, 8753698786, 25212426370, 23283391904, 1590220117, 7031266077, 49933357363, 49810568704,
                49579103229, 4335429592, 2232578576, 7986964647, 47932270300, 32535397456, 45861290503, 693622286,
                14337900284, 6752574328, 4850509279, 50376744417, 1451770453, 50276486159, 1743128985, 49211663775,
                3079226819, 48445046745, 8475951353, 4057384199, 29636343889, 47016662606, 1319079722, 49893822396,
                10746177136, 348608308, 1456505084, 19557708, 1417505847, 6722675808, 21879737140, 48180400, 1111500398,
                7177345146, 14678383106, 5359243551, 6866091494, 16256684585, 10818022368, 10492684252, 14709247705,
                5576540053, 11109180982, 46845620680, 46964775084, 16969742159, 9129596639, 8918869820, 48021227145,
                32049499393, 49494797717, 41456534862, 17589351785, 26834381722, 4579839956, 2270653655, 47420783831,
                11563466513, 21855157054, 642559770, 1590220117, 5583407872, 2037461071, 27265486573, 12976540,
                5335985739, 48870165724, 39302047402, 45165000633, 1426195248, 1809767677, 1417308242, 25622870126,
                1503757953, 1354292162, 44322609322, 3208289676, 49608916651, 47075863501, 17465745373, 44545102663,
                49869502067, 3543395050, 7705286588, 46713595942, 49926087008, 47730044181, 9295246022, 49500957981,
                48214389800, 48747722201, 49741412580, 50353033664, 46903983054, 49393893631, 14776966040, 3887741105,
                3293121200, 49059089564, 181490360, 49719663100, 3858833408, 50418845928, 48336661647, 7397793273,
                50284169072, 29382896136, 50460374089, 26772901105, 50132273589, 1566620948, 31982150752, 48900892124,
                49377830033, 31770803980, 52576937037, 50656980646, 45167010013, 49757419329, 47196428981, 7471261334,
                1709491151, 48275740259, 40998879921, 50168375554, 47936865282, 47476001917, 30380036647, 5402642559,
                37606021618, 3937945866, 5676146464, 48789359232, 50301115292, 4766252778, 28331145114, 498913510,
                50449967675, 49658449562, 49369614172, 1362679313, 39668674931, 6613688794, 6103986200, 49888807654,
                49983928123, 50645920287, 50284550823, 24961040137, 50304716316, 2307433805, 2143410781, 3523480977,
                50500885989, 39617383530, 46039819591, 4582103548, 3500143626, 50437046652, 41426460424, 50207659546,
                50298556475, 50123966001, 47223127348, 49315342247, 49042666186, 2055412762, 21849335272, 50663752333,
                4909728767, 50403103343, 31605526200, 50407638782, 50429914320, 49871455779, 30742212825, 18822593615,
                14889095569, 49827879113, 48211666265, 47550544704, 26428631928, 39406478276, 50890931699, 1577397631,
                50325491746, 46082615862, 47404426860, 49334974403, 49765142342, 504426797, 13355510918, 2308693126,
                50708626128, 50435442999, 6330355647, 50288782575, 4210253008, 50221839468, 50223223412, 3673333792,
                50098761087, 48829182476, 50410933269, 50520427245, 49271648361, 26079889909, 50413194671, 7883622283,
                50261814466, 8551358173, 6268236687, 48205846744, 16380857, 45006172222, 49804065083, 50650652304,
                46907736838, 26819327899, 50467406960, 6675101876, 4789845825, 1685766074, 24995323707, 35666091183,
                50298382190, 47581766520, 50312107968, 50201495221, 50650665148, 46245362899, 49448278080, 50683707189,
                37059670859, 45094810930, 44520275209, 49073640248, 50709706885, 50243664402, 50259367630, 26766954939,
                49819195889, 5394685056, 49823043885, 1050280174, 3830373248, 4111063763, 2948099726, 50006931899,
                50089939010, 13681211626, 50243717247, 43622965396, 47780066574, 367805867, 50208351287, 7662540673,
                5635228184, 742072241, 48338754917, 389901102, 46134390935, 17050167599, 49004255679, 49992910120,
                50025367102, 47730897988, 1556429270, 50172030464, 50458720015, 48619929630, 49826343728, 21009999282,
                49096514096, 49937357784, 3303069901, 18396897980, 2157686220, 13103485475, 4141625345, 50004434919,
                46952099565, 49354730296, 49660810169, 18613912750, 49648121258, 48147176022, 50064886416, 31247932613,
                12124276289, 48611801618, 7573503714, 49482965614, 8190314584, 50262620069, 49167291256, 48655956210,
                13048712340, 50265658217, 49784846176, 1924204086, 49853160206, 50009040402, 10471158872, 50218784070,
                49614591856, 44660560220, 8887983104, 47236844268, 47490084033, 47844954796, 1260257080, 24537964151,
                1559889989, 48018524572, 48263467683, 956948857, 1938547216, 48340303328, 48165550604, 1435939243,
                49735503553, 47725633982, 50235157108, 49405267535, 50434835011, 50405130737, 33524488691, 48538094288,
                7470611478, 50062741351, 49784880439, 47836055864, 334558177, 50186551004, 50251577987, 49622766994,
                49858540808, 49752506406, 50163694480, 50166025500, 50028322500, 49565951412, 49590044782, 45901487589,
                206227670, 49871517998, 45245513242, 50428713165, 1547440122, 661705339, 840957290, 4872421265,
                5851078105, 6214996367, 49896657217, 4565122487, 6589249122, 8356147581, 4611441527, 49127949871,
                45849996581, 8757428014, 50189177469, 49851990277, 44008997269, 46238622265, 4210253008, 5607352120,
                49825110047, 49645596598, 49793814658, 1438181298, 50062226109, 50209286214, 1706975305, 38297782498,
                50179723035, 49983181837, 49897545145, 1837951906, 49895024262, 7269171138, 10922388738, 4935623730,
                444775342, 1654903371, 50239954116, 49973192383, 8118319974, 183795, 4972696986, 49407774535,
                46916465785, 44084551381, 1790449743, 47557029859, 49228333768, 8750840129, 50248462130, 49956610108,
                49706881616, 49159186047, 1614550034, 50286208202, 23650476114, 45007612190, 50313232719, 2321511291,
                15183524757, 50126476059, 49832682347, 49757437092, 49880244954, 14552331314, 9289136037, 47422102360,
                46973172583, 1752320355, 45283926728, 50206340199, 49828771100, 49879353338, 49845855507, 48340986643,
                48906891511, 47726556038, 50648884697, 49879160915, 48073049579, 49708121780, 8084198811, 4472278530,
                49801901932, 686190065, 8703541466, 6673442388, 8488594222, 47924067177, 49531981827, 49660778707,
                44616388065, 4809680488, 50500400757, 2006853842, 48181928061, 6096153712, 19263064, 49569757232,
                5746437649, 49979670372, 28384433698, 25521131604, 19025024015, 46692436623, 48317191121, 35060113724,
                49200966438, 2204960387, 50492257417, 49685228918, 1384598698, 49631722734, 9361446113, 50007560045,
                11359412207, 48495572336, 50409066320, 49809301151, 46285843437, 49702882741, 50229813996, 24337210077,
                49992580877, 50004602754, 6210238045, 50483538729, 47155650474, 50164583785, 49710143297, 7041396500,
                49620032872, 49405843059, 49950313321, 41893732207, 49721203129, 2023423004, 49938926958, 50040184951,
                49751780659, 50128794600, 49843889204, 50303019374, 50224797436, 45879224370, 13780616338, 46201219644,
                2020553827, 46579380793, 6819621249, 49337632367, 31096379119, 49823251244]

    # response = login_by_session("54643180776%3AjN9IuooPqRIGwA%3A16%3AAYfmOkeGnahb0uK9PViSOMf5_DTQcGcgSSWYx3CBIA")

    ## 스레드당 발송 메세지 수를 정한다.


    ## 총 몇개의 쓰레드를 사용할지 파악
    total_required_thread = len(user_ids)/MAX_USERID_PER_THREAD
    total_required_thread = math.ceil(total_required_thread)

    logger.info(f"total_required_thread:{total_required_thread}")

    for i in range(0, total_required_thread):
        prev_page = MAX_USERID_PER_THREAD*i
        next_page = MAX_USERID_PER_THREAD*(i+1)
        job = user_ids[prev_page:next_page]
        jobs.put(job)

    run_thread(total_required_thread)
    jobs.join()
    logger.info("all task is done")
